doc/html/handlers/config.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Config Handler</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Config Handler"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-18 03:24:27 CDT"/>
<meta name="author" content="Jesse Gumm (@jessegumm)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<LINK href="../stylesheet.css" rel="stylesheet" type="text/css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Config Handler</h1>

<p><a href="../index.html">Getting Started</a> | <a href="../api.html">API</a> | <a href="../elements.html">Elements</a> | <a href="../actions.html">Actions</a> | <a href="../validators.html">Validators</a> | <a href="../handlers.html"><b>Handlers</b></a> | <a href="../config.html">Configuration Options</a> | <a href="../about.html">About</a>
</p>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Config Handler</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Config Handler</h2>
<div class="outline-text-2" id="text-1">


<p>
  The config handler controls how the configuration settings are loaded. This
  is probably not something that's likely to get changed.
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3"></span> Behavior Functions</h3>
<div class="outline-text-3" id="text-1-1">



</div>

<div id="outline-container-1-1-1" class="outline-5">
<h5 id="sec-1-1-1"><span class="section-number-5"></span> <code>init(Config, State)</code></h5>
<div class="outline-text-5" id="text-1-1-1">


<p>
  Initialize the handler
</p>
<ul>
<li><i>Return Value</i> - <code>{ok, NewState}</code> 
</li>
</ul>


</div>

</div>

<div id="outline-container-1-1-2" class="outline-5">
<h5 id="sec-1-1-2"><span class="section-number-5"></span> <code>finish(Config, State)</code></h5>
<div class="outline-text-5" id="text-1-1-2">


<p>
  Clean up the handler
</p>
<ul>
<li><i>Return Value</i> - <code>{ok, NewState}</code>
</li>
</ul>


</div>

</div>

<div id="outline-container-1-1-3" class="outline-5">
<h5 id="sec-1-1-3"><span class="section-number-5"></span> <code>get_value(Key, DefaultValue, Config, State)</code></h5>
<div class="outline-text-5" id="text-1-1-3">


<p>
  Search the configuration for the key and return the value
</p>
<ul>
<li><code>Key</code> - The configuration key to find

</li>
<li><code>DefaultValue</code> - If the <code>Key</code> is not found, return the provided value

</li>
<li><i>Return Value</i> - The value of the found key
</li>
</ul>


</div>

</div>

<div id="outline-container-1-1-4" class="outline-5">
<h5 id="sec-1-1-4"><span class="section-number-5"></span> <code>get_values(Key, DefaultValue, Config, State)</code></h5>
<div class="outline-text-5" id="text-1-1-4">


<p>
  Search the configuration and return a list of found values,
  if the configuration system you're using can return multiple
  values for a single key.
</p>
<ul>
<li><code>Key</code> - The configuration key to find

</li>
<li><code>DefaultValue</code> - If the <code>Key</code> is not found, return the provided value

</li>
<li><i>Return Value</i> - The values of the found key
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3"></span> Example</h3>
<div class="outline-text-3" id="text-1-2">





<pre class="src src-erlang"><span class="org-preprocessor">-module</span> (default_config_handler).
<span class="org-preprocessor">-include_lib</span> (<span class="org-string">"wf.hrl"</span>).
<span class="org-preprocessor">-behaviour</span> (config_handler).
<span class="org-preprocessor">-export</span> ([
    <span class="org-type">init/2</span>,
    <span class="org-type">finish/2</span>,
    <span class="org-type">get_value/4</span>,
    <span class="org-type">get_values/4</span>
]).

<span class="org-function-name">init</span>(<span class="org-variable-name">_Config</span>, <span class="org-variable-name">_State</span>) -&gt;
    {ok, []}.

<span class="org-function-name">finish</span>(<span class="org-variable-name">_Config</span>, <span class="org-variable-name">_State</span>) -&gt;
    {ok, []}.

<span class="org-function-name">get_value</span>(<span class="org-variable-name">Key</span>, <span class="org-variable-name">DefaultValue</span>, <span class="org-variable-name">Config</span>, <span class="org-variable-name">State</span>) -&gt;
    <span class="org-keyword">case</span> <span class="org-type">get_values</span>(<span class="org-variable-name">Key</span>, [<span class="org-variable-name">DefaultValue</span>], <span class="org-variable-name">Config</span>, <span class="org-variable-name">State</span>) <span class="org-keyword">of</span>
        [<span class="org-variable-name">Value</span>] -&gt;
            <span class="org-variable-name">Value</span>;
        <span class="org-variable-name">Values</span> -&gt;
            <span class="org-type">error_logger</span>:<span class="org-type">error_msg</span>(<span class="org-string">"Too many matching config values for key: ~p~n"</span>, [<span class="org-variable-name">Key</span>]),
            <span class="org-builtin">throw</span>({nitrogen_error, too_many_matching_values, <span class="org-variable-name">Key</span>, <span class="org-variable-name">Values</span>})
    <span class="org-keyword">end</span>.

<span class="org-function-name">get_values</span>(<span class="org-variable-name">Key</span>, <span class="org-variable-name">DefaultValue</span>, <span class="org-variable-name">_Config</span>, <span class="org-variable-name">_State</span>) -&gt;
    <span class="org-keyword">case</span> <span class="org-type">application</span>:<span class="org-type">get_env</span>(nitrogen, <span class="org-variable-name">Key</span>) <span class="org-keyword">of</span>
        {ok, <span class="org-variable-name">Value</span>} -&gt;
            [<span class="org-variable-name">Value</span>];
        undefined -&gt;
            <span class="org-variable-name">DefaultValue</span>
    <span class="org-keyword">end</span>.
</pre>


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3"></span> See Also</h3>
<div class="outline-text-3" id="text-1-3">


<ul>
<li><a href="../handlers.html">Handler Overview</a>

</li>
<li><a href="../api.html#sec-15">API: Configuration</a>
</li>
</ul>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-10-18 03:24:27 CDT</p>
<p class="author">Author: Jesse Gumm (@jessegumm)</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div><h2>Comments</h2>
<b>Note:</b><!-- Disqus does not currently support Erlang for its syntax highlighting, so t-->To specify <!--Erlang--> code blocks, just use the generic code block syntax: <pre><b>&lt;pre&gt;&lt;code&gt;your code here&lt;/code&gt;&lt;/pre&gt;</b></pre>
<br />
<br />
<div id="disqus_thread"></div>
<script type="text/javascript">
	/* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
	var disqus_shortname = 'nitrogenproject'; // required: replace example with your forum shortname
	var disqus_identifier = 'html/handlers/config.html'; //This will be replaced with the path part of the url

	/* * * DON'T EDIT BELOW THIS LINE * * */
	(function() {
		var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
		dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';
		(document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
	})();
</script>
<noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
<a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>
</body>
</html>
